:PROPERTIES:
:ID:       2b7dae76-003f-4714-b621-c046d855fe3e
:END:
#+TITLE: Ansible: setup a portable environment on Guix
#+CATEGORY: slips
#+property: header-args            :tangle-mode (identity #o400) :mkdirp yes
#+property: header-args:conf       :tangle-mode (identity #o600) :mkdirp yes
#+property: header-args:sh         :tangle-mode (identity #o500) :mkdirp yes
#+property: header-args:shell      :tangle-mode (identity #o500) :mkdirp yes
#+property: header-args:scheme     :tangle-mode (identity #o500) :mkdirp yes
#+property: header-args:emacs-lisp :tangle-mode (identity #o600) :mkdirp yes
#+TAGS:


Don't put your secrets on a LUKS drive. Either vault, ansible-vault, pass or
some other means is much better.

+ Vault requires certificate deployment, but integrates nicely in k3s or K8S.
+ Ansible Vault permits retrieval of secrets GPG-encrypted at rest.

It is quite a relief to trust GPG on a smartcard though.

** Playbooks

Hmmmm... thanks [[https://bruxy.regnet.cz/web/linux/EN/bash-cheat-sheet/][Bash Cheatsheet]]. Noam Chomsky gently weeps colorlessly for
Tarzan-child of wilderness (reference to alienation)

#+begin_src sh :var prefix=ansible-prefix
unset $dryrun
#prefix=
#dryrun=echo
#dryrun=
centos=$prefix/roles/centos
gcloud=$prefix/roles/gcloud
virt=$prefix/roles/virt
qemu=$prefix/roles/qemu

role_dirs="tasks,handlers,templates,files,vars,defaults"
dircmd=${dryrun-"mkdir -p"}
filecmd=${dryrun-"touch"}

if [ -e $prefix ]; then
    echo "creating template at $prefix"
    $filecmd $prefix/{homelab,cloud,virt,qemu}

    # make root directory
    $dircmd $prefix/{group_vars,host_vars}
    $dircmd $prefix/{library,module_utils,filter_plugins,tasks}

    # make role directories
    $dircmd {$centos/,$gcloud/,$virt/,$qemu/}{tasks,handlers}
    $dircmd {$centos/,$gcloud/,$virt/,$qemu/}{templates,files,vars,defaults}
    $dircmd {$centos/,$gcloud/,$virt/,$qemu/}{meta,library,module_utils,lookup_plugins}

    # this also works
    # $filecmd {$centos/,$gcloud/,$virt/,$qemu/}{tasks,handlers}/main.yml
else
    echo "set prefix"
fi

#+end_src

#+RESULTS:
: creating template at /mnt/secrets/test

I'm sure there's a better way to do this, but i've looked. In the various
attempts at learning ansible, I've way too much time looking for templating
tools that were not ad-hoc github collections

